In [1]:
import pandas as pd

In [20]:
data = {'Department': ['HR', 'IT', 'HR', 'IT', 'Finance', 'Finance', 'IT', 'HR'],
        'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Helen'],
        'Salary': [50000, 70000, 45000, 80000, 60000, 62000, 72000, 48000],
        'Experience': [5, 7, 4, 10, 8, 6, 9, 3]}

df = pd.DataFrame(data)
df

  Department Employee  Salary  Experience
0         HR    Alice   50000           5
1         IT      Bob   70000           7
2         HR  Charlie   45000           4
3         IT    David   80000          10
4    Finance      Eve   60000           8
5    Finance    Frank   62000           6
6         IT    Grace   72000           9
7         HR    Helen   48000           3

In [25]:
df.groupby('Department', as_index=False)['Salary'].sum()

  Department  Salary
0    Finance  122000
1         HR  143000
2         IT  222000

In [23]:
df.groupby('Department')['Salary'].mean()

Department
Finance    61000.000000
HR         47666.666667
IT         74000.000000
Name: Salary, dtype: float64

In [26]:
df.groupby('Department')['Salary'].max()

Department
Finance    62000
HR         50000
IT         80000
Name: Salary, dtype: int64

In [29]:
df_mod = pd.merge(left=df, right=df.groupby('Department')['Salary'].mean(), on='Department')
df_mod

  Department Employee  Salary_x  Experience      Salary_y
0         HR    Alice     50000           5  47666.666667
1         IT      Bob     70000           7  74000.000000
2         HR  Charlie     45000           4  47666.666667
3         IT    David     80000          10  74000.000000
4    Finance      Eve     60000           8  61000.000000
5    Finance    Frank     62000           6  61000.000000
6         IT    Grace     72000           9  74000.000000
7         HR    Helen     48000           3  47666.666667

In [31]:
df_mod.rename(columns={'Salary_x': 'Salary',
                       'Salary_y': 'Avg_Salary'}, inplace=True)

In [44]:
df

  Department Employee  Salary  Experience
0         HR    Alice   50000           5
1         IT      Bob   70000           7
2         HR  Charlie   45000           4
3         IT    David   80000          10
4    Finance      Eve   60000           8
5    Finance    Frank   62000           6
6         IT    Grace   72000           9
7         HR    Helen   48000           3

In [54]:
def get_category(val):
    if val > 5:
        return 'Senior'
    else:
        return 'Junior'

df['Experience_category'] = df['Experience'].apply(lambda val: get_category(val))

In [56]:
df.groupby('Experience_category')['Salary'].sum()

Experience_category
Junior    143000
Senior    344000
Name: Salary, dtype: int64

In [57]:
marks_data = {'Student': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Helen'],
              'Subject': ['Math', 'Math', 'Math', 'Science', 'Science', 'Science', 'Math', 'Science'],
              'Marks': [85, 78, 92, 88, 76, 95, 89, 80]}
marks_df = pd.DataFrame(marks_data)
marks_df

   Student  Subject  Marks
0    Alice     Math     85
1      Bob     Math     78
2  Charlie     Math     92
3    David  Science     88
4      Eve  Science     76
5    Frank  Science     95
6    Grace     Math     89
7    Helen  Science     80

In [58]:
#Find the average marks for each subject.
marks_df.groupby('Subject')['Marks'].mean()

Subject
Math       86.00
Science    84.75
Name: Marks, dtype: float64

In [64]:
#Find the highest and lowest marks in each subject.
print(f'Minimum marks: {marks_df.groupby('Subject')['Marks'].min()}\nMaximum marks: {marks_df.groupby('Subject')['Marks'].max()}')

Minimum marks: Subject
Math       78
Science    76
Name: Marks, dtype: int64
Maximum marks: Subject
Math       92
Science    95
Name: Marks, dtype: int64

In [65]:
from sklearn.datasets import load_iris
data = load_iris(return_X_y=True)
X = data[0]
y = data[-1]
cols = load_iris().feature_names

df = pd.DataFrame(X, columns=cols)
df['target'] = y
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   sepal length (cm)  150 non-null    float64
 1   sepal width (cm)   150 non-null    float64
 2   petal length (cm)  150 non-null    float64
 3   petal width (cm)   150 non-null    float64
 4   target             150 non-null    int32
dtypes: float64(4), int32(1)
memory usage: 5.4 KB

In [81]:
df.pivot_table(values=['sepal length (cm)', 'sepal width (cm)'], index='target', aggfunc={'sepal length (cm)': ['max', 'min'],
                                                                                          'sepal width (cm)': 'mean'})

       sepal length (cm)      sepal width (cm)
                     max  min             mean
target
0                    5.8  4.3            3.428
1                    7.0  4.9            2.770
2                    7.9  4.9            2.974